app/controllers/characters/states_controller.rb

SELECT "characters".* FROM "characters" WHERE "characters"."id" = 14635 LIMIT 1
SELECT "chr_states".* FROM "chr_states" WHERE ("chr_states".character_id = 14635) LIMIT 50 OFFSET 0
---
    def index
      respond_to do |format|
        format.any(:xml, :json) {
          @states =
            (@resource = Character.find(params[:character_id]).states).
              offset(params[:start].to_i || 0).
              limit( params[:limit].to_i || 50)