app/controllers/ontologies_controller.rb

INSERT INTO "ontologies" ("bioportal_ontology_id") VALUES (1070)
---
  def create
    Ontology.create!(params[:ontology])