app/controllers/phenotypes_controller.rb

SELECT "ontologies".* FROM "ontologies"
---
  def new
    debugger
    @ontology_ids = Ontology.all.collect(&:ontology_id)